In [2]:
from IPython.core.display import display, HTML
display(HTML("<style>.container {width:100% !important;}</style>"))

### 웹개발: Flask 혹은 장고
### 데이터베이스: SQL
### 데이터분석: Pandas

pandas에 저장되는 베이터 구조는 크게 2가지: Series, DataFrame 

Series는 사실상 list와 똑같음

In [1]:
import pandas as pd

## Series

Python의 list와 Pandas의 Series는 사실상 같음

In [2]:
odd = [1, 3, 5, 7, 9]
odd

[1, 3, 5, 7, 9]

In [3]:
pd_odd = pd.Series(odd)
pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

Python의 list와 Pandas의 Series가 같으면 그냥 list쓰지 왜 Series를 굳이 쓸까?
* Pandas의 Series로 바꿔줘야 Pandas의 기능을 쓸 수가 있음

EX) list는 Pandas의 mean()을 쓸 수 없지만 Series는 쓸 수 있음

In [4]:
odd.mean()

AttributeError: 'list' object has no attribute 'mean'

In [5]:
pd_odd.mean()

5.0

## DataFrame

Pandas에서 사용하는 대부분의 일들이 DataFrame에서 일어남

In [6]:
numbers = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]

numbers = pd.DataFrame(numbers)
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

DataFrame은 여러개의 Series로 이루어져 있다

In [7]:
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
type(numbers)

pandas.core.frame.DataFrame

In [9]:
numbers[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [10]:
type(numbers[0])

pandas.core.series.Series

In [11]:
numbers.loc[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [12]:
type(numbers.loc[0])

pandas.core.series.Series

DataFrame은 수학적으로 행렬, Series는 수학적으로 벡터와 같다고 이해하면 쉬움

## Data Type

In [13]:
# int == integer == 정수형
type(1)

int

In [14]:
# float == 실수형
type(1.0)

float

# str == string == 문자열
type('Hello World')

In [16]:
odd = [1, 3, 5, 7, 9]

odd = pd.Series(odd)

odd.dtypes

dtype('int64')

data type이 전부 int

int64에서 64는 bit를 말함. 예전에는 컴퓨터가 32bit, 64bit 있었지만 요새는 거의다 64bit이므로 이게 default라고 생각하면 됌

int32는 나중에 쓸 일이 있을 수 있지만 거의 없음

In [17]:
odd = [1, 3, 5, 7.0, 9]

odd = pd.Series(odd)

odd.dtypes

dtype('float64')

Series에 들어가있는 모든 값 중에 하나라도 실수면 그 Series의 data type은 실수형임

float은 int를 포함하는 개념이기 때문

In [18]:
odd = [1, 3, 5, 7.0, 9, 'hello!']

odd = pd.Series(odd)

odd.dtypes

dtype('O')

O == object == str == string

pandas에선 O라 하고, python에선 str이라고 함 둘이 같은 것.

## NaN (Not a Number)

In [19]:
import numpy as np

odd = [1, np.nan, 5, 7, 9]

odd = pd.Series(odd)

odd#.dtypes

0    1.0
1    NaN
2    5.0
3    7.0
4    9.0
dtype: float64

NaN의 데이터 타입은 float(실수형임)

In [20]:
odd.mean()

5.5

nan은 빼고 평균을 구함

데이터가 비어있는 경우 nan으로 꼼꼼하게 처리해줘야 함

NaN값을 다른 값으로 대체해주는 경우가 있는데 이럴 경우 data type이 바뀔 수 있음 (EX: nan을 -1로 바꿔준 경우) data type은 int가 나옴

In [21]:
import numpy as np

odd = [1, -1, 5, 7, 9]

odd = pd.Series(odd)

odd#.dtypes

0    1
1   -1
2    5
3    7
4    9
dtype: int64

In [22]:
np.nan == np.nan

False

NaN과 NaN은 비교할 수 없음

In [23]:
value = np.nan
pd.isnull(value)

True

isnull하면 비어있으면 True 안비어있으면 False가 나옴

In [24]:
pd.notnull(value)

False

notnull은 비어있으면 False 안비어있으면 True

NaN은 비어있다는 개념이고 Pandas에선 isnull이나 notnull로 별도처리해줘야함

## DataFrame

## 생성하기

In [25]:
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-03', 700, 'confirmed'],
    ['2017-01-10', 200, 'canceled'],
]

order = pd.DataFrame(order)

order

            0    1          2
0  2017-01-01  500  confirmed
1  2017-01-03  700  confirmed
2  2017-01-10  200   canceled

Python의 이중 리스트를 Pandas의 DataFrame으로 바꿀 수 있음.

근데 column값은 직접 입력해줘야함

In [26]:
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-03', 700, 'confirmed'],
    ['2017-01-10', 200, 'canceled'],
]

columns = ['date', 'price', 'sate']

order = pd.DataFrame(order, columns = columns)

order

         date  price       sate
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

column과 order의 개수가 안맞으면 에러가 남

좀 더 자주 쓰이는 방식. 위의 방식보다 아래 방식이 좀 더 좋음. 데이터들이 같이 붙어있어서 더 편리함

In [27]:
order = {
    'date': ['2017-01-01', '2017-01-03', '2017-01-10'],
    'price': [500, 700, 200],
    'state': ['confirmed', 'confirmed', 'canceled']
}

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [28]:
order = [
    {'date': '2017-01-01', 'price': 500, 'state': 'confirmed'},
    {'date': '2017-01-03', 'price': 700, 'state': 'confirmed'},
    {'date': '2017-01-10', 'price': 200, 'state': 'canceled'},
]

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

2번째나 3번째가 좋음. 근데 보통은 외부에서 긁어오는 데이터의 형태가 아래(3번째) 방식인 경우가 많음

맨 위에 있는 id user_id product_id... 등은 column

맨 왼쪽 0, 1, 2, 3, 4 는 index. row 한 줄을 상징

In [29]:
order_url = 'https://bit.ly/dsa-01-order'

order = pd.read_csv(order_url)

order

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

index는 항상 0부터 시작

만약 column 중에 row를 대변할 수 있는 column이 있으면 그걸 왼쪽으로 빼서 index로 써도 됌

이 경우 id를 index로 사용할 수 있음

In [30]:
order_url = 'https://bit.ly/dsa-01-order'

order = pd.read_csv(order_url, index_col = 'id')

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [31]:
order_url = 'https://bit.ly/dsa-01-order'

order = pd.read_csv(order_url)
order = order.set_index('id')

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

column과 index를 제외한 것은 다 value라고 함

In [32]:
order.index

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [33]:
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [34]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

In [35]:
type(order.index)

pandas.core.indexes.numeric.Int64Index

type이 int64Index라고 적혀있는데 그냥 Series라고 똑같다고 이해해도 됌

In [36]:
# data column 바꿀 수 있음

order.columns = ['user_id', 'product_id', 'date', 'amount', 'address', 'result']

order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

In [37]:
# 다 출력하면 지저분해보일 수 있음. head나 tail로 조정 가능

order.head(3)

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed

In [38]:
order['date'].head()

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
Name: date, dtype: object

## 기본 연산

In [39]:
order['amount'].mean()

585.7142857142857

In [40]:
order['amount'].min()

200

In [41]:
order['amount'].max()

900

In [42]:
order['amount'].describe()

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

In [43]:
order['result']

id
1    confirmed
2    confirmed
3    confirmed
4     canceled
5    confirmed
6     canceled
7     canceled
Name: result, dtype: object

In [44]:
# 어떤 한 column의 value 종류를 알고 싶은 경우
# 중복을 제거해 줌

order['result'].unique()

array(['confirmed', 'canceled'], dtype=object)

In [45]:
# confirmed는 몇 개고 canceled는 총 몇 개 인지

order['result'].value_counts()

confirmed    4
canceled     3
Name: result, dtype: int64

In [46]:
# 몇 %인지 비중을 알고싶을 때

order['result'].value_counts(normalize = True)

confirmed    0.571429
canceled     0.428571
Name: result, dtype: float64

In [47]:
# value를 바꾸고 싶을 때, confirmed -> comfirm     canceled -> cancel

order['result'].replace('confirmed', 'confirm').replace('canceled', 'cancel')

id
1    confirm
2    confirm
3    confirm
4     cancel
5    confirm
6     cancel
7     cancel
Name: result, dtype: object

In [48]:
# 하지만 다시 order를 출력하면 바껴있지 않음

order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

Pandas는 기본적으로 스스로 무언가를 고치는 것을 부정적으로 생각함. 지양함

데이터가 바뀌기 시작하면서 버그가 발생할 소지가 있기 때문에.

그렇기 때문에 무언가를 고치려면 명시적으로 문법을 추가해줘야 함

In [49]:
order['result'] = order['result'].replace('confirmed', 'confirm').replace('canceled', 'cancel')

order

    user_id  product_id        date  amount  address   result
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

In [50]:
order['date']

id
1    2017-01-01
2    2017-01-03
3    2017-01-03
4    2017-01-07
5    2017-01-09
6    2017-01-09
7    2017-01-10
Name: date, dtype: object

위의 data는 사람이 보면 바로 날짜인걸 알 수 있지만 컴퓨터는 알기 힘듬

컴퓨터는 0~9 그리고 .(점) 빼고는 다 문자로 간주

In [51]:
# 이 column은 날짜 column이야 라고 말해줄 수 있음

order['date'] = pd.to_datetime(order['date'])

order['date']

id
1   2017-01-01
2   2017-01-03
3   2017-01-03
4   2017-01-07
5   2017-01-09
6   2017-01-09
7   2017-01-10
Name: date, dtype: datetime64[ns]

In [52]:
# year 혹은 month, day를 따로 쓸 수 있음

order['date'].dt.year # month / day

id
1    2017
2    2017
3    2017
4    2017
5    2017
6    2017
7    2017
Name: date, dtype: int64

## 행렬 검색하기

In [53]:
# 가장 일반적인 column 검색 방식

order['date']

id
1   2017-01-01
2   2017-01-03
3   2017-01-03
4   2017-01-07
5   2017-01-09
6   2017-01-09
7   2017-01-10
Name: date, dtype: datetime64[ns]

In [54]:
# column을 2개 이상 검색할 때

order[['user_id', 'date', 'amount']]

    user_id       date  amount
id
1         3 2017-01-01     500
2         1 2017-01-03     700
3         3 2017-01-03     900
4         4 2017-01-07     500
5         7 2017-01-09     700
6         5 2017-01-09     600
7         2 2017-01-10     200

In [55]:
columns = ['user_id', 'date', 'amount']

order[columns]

    user_id       date  amount
id
1         3 2017-01-01     500
2         1 2017-01-03     700
3         3 2017-01-03     900
4         4 2017-01-07     500
5         7 2017-01-09     700
6         5 2017-01-09     600
7         2 2017-01-10     200

column을 2개 이상 쓸 때 대괄호를 2개 쓰는 이유: Python과의 문법 호환성 때문에

columns = 'user_id', 'date', 'amount'

order[columns]

이렇게 하면 python에서 안되기때문

In [56]:
type(order)

pandas.core.frame.DataFrame

In [57]:
# DataFrame은 Series로 이루어져 있음
# column 1개를 가져오면 data type은 Series

type(order['date'])

pandas.core.series.Series

In [58]:
# column을 여러개 가져오면 data type은 DataFrame

type(order[['user_id', 'date', 'amount']])

pandas.core.frame.DataFrame

In [59]:
# row 1개 가져오는 방법: 맨 왼쪽에 index를 기준으로 가져옴
# loc == locate

order.loc[1]

user_id                         3
product_id                      9
date          2017-01-01 00:00:00
amount                        500
address                     Seoul
result                    confirm
Name: 1, dtype: object

In [60]:
# row도 column처럼 여러 개 가져올 수 있음
# 똑같이 대괄호 2번 사용. 대괄호 2개의 쓰임이 다르기 때문

order.loc[[1, 3, 7]]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
7         2           5 2017-01-10     200      NaN   cancel

In [61]:
# 위의 문법과 아래의 문법은 사실상 동일한 문법 

order_ids = [1, 3, 7]

order.loc[order_ids]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
7         2           5 2017-01-10     200      NaN   cancel

data type은 column 과 유사하게 row도 역시 

1 개 가져오면 Series, 여러 개 가져오면 DataFrame

In [62]:
type(order.loc[1])

pandas.core.series.Series

In [63]:
type(order.loc[[1, 3, 7]])

pandas.core.frame.DataFrame

In [64]:
order

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

한 번에 동시에 row와 column을 동시에 가져와야 할 때도 있음.\
3가지 방법이 있음

In [65]:
# 1. 첫번째 방법(권장하지 않음)

order.loc[1]['date']

Timestamp('2017-01-01 00:00:00')

위의 코드가 한줄처럼 보여서 한번만 실행될거다 라고 생각할 수 있지만, 실제로 Pandas에서 행렬을 가져올 때는 대괄호를 몇번 열고 닫았냐가 실행의 횟수. 위의 경우 2번 열고 닫은 것임.

In [66]:
# 2. 두번째 방법(권장하는 방법)
# 속도도 더 빠르고 Pandas가 권장하는 방식

# order.loc[index, column]
order.loc[1, 'date']

Timestamp('2017-01-01 00:00:00')

In [67]:
%timeit order.loc[1]['date']

131 µs ± 2.39 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [68]:
%timeit order.loc[1, 'date']

7.2 µs ± 59.9 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

두번째 방식이 훨씬 빠른 것을 볼 수 있음

In [69]:
# 3. 세번째 방법

order.at[1, 'date']

Timestamp('2017-01-01 00:00:00')

In [70]:
%timeit order.at[1, 'date']

4.75 µs ± 140 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

속도는 at이 더 빠름. 그러나 at은 단점이 있음

row도 column도 1 개 씩 밖에 적용이 안됌

In [71]:
order.at[[1, 3, 7], ['date', 'amount']]

ValueError: At based indexing on an integer index can only have integer indexers

In [72]:
order.loc[[1, 3, 7], ['date', 'amount']]

         date  amount
id
1  2017-01-01     500
3  2017-01-03     900
7  2017-01-10     200

loc와 at의 차이점: row나 column을 한번만 검색하고 싶다면 at을 사용하는게 빠름

행렬을 검색할 때는 loc를 사용

## 색인(검색하는 기능)

In [73]:
order

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [74]:
order['date'] == '2017-01-03'

id
1    False
2     True
3     True
4    False
5    False
6    False
7    False
Name: date, dtype: bool

In [75]:
order[order['date'] == '2017-01-03']

    user_id  product_id       date  amount  address   result
id
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm

In [76]:
order['date'] != '2017-01-03'

id
1     True
2    False
3    False
4     True
5     True
6     True
7     True
Name: date, dtype: bool

In [77]:
order[order['date'] != '2017-01-03']

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [78]:
order[order['amount'] >= 500]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [79]:
# date_candidates 안에 있는 날짜와 일치하면 True 아니면 False

date_candidates = ['2017-01-01', '2017-01-05', '2017-01-09']

order['date'].isin(date_candidates)

id
1     True
2    False
3    False
4    False
5     True
6     True
7    False
Name: date, dtype: bool

In [80]:
date_candidates = ['2017-01-01', '2017-01-05', '2017-01-09']

order[order['date'].isin(date_candidates)]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [81]:
order

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [82]:
# 비어있는 값 NaN 처리
# 비어있으면 True, 비어있지않으면 False

order['address'].isnull()

id
1    False
2    False
3    False
4     True
5    False
6    False
7     True
Name: address, dtype: bool

In [83]:
order[order['address'].isnull()]

    user_id  product_id       date  amount address  result
id
4         4           2 2017-01-07     500     NaN  cancel
7         2           5 2017-01-10     200     NaN  cancel

In [84]:
# 안비어있는 걸 가져오는 방법 2가지 있음
# ~ 표시는 다른 곳에서도 뒤집는 데 사용될 수 있음

# 1. 첫번째 방식

~order['address'].isnull()

id
1     True
2     True
3     True
4    False
5     True
6     True
7    False
Name: address, dtype: bool

In [85]:
order[~order['address'].isnull()]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [86]:
# 2번째 방식

order['address'].notnull()

id
1     True
2     True
3     True
4    False
5     True
6     True
7    False
Name: address, dtype: bool

In [87]:
order[order['address'].isnull()]

    user_id  product_id       date  amount address  result
id
4         4           2 2017-01-07     500     NaN  cancel
7         2           5 2017-01-10     200     NaN  cancel

In [88]:
# 조건이 하나가 아닌 경우
# amount가 500이상이면서 result가 confirm인 경우
# and는 pandas에서 사용 불가
# &(and, shift + 7) 사용해야 함
# & 주의사항: 괄호로 명확하게 연산 우선순위를 정해줘야함

(order['amount'] >= 500) & (order['result'] == 'confirm')

id
1     True
2     True
3     True
4    False
5     True
6    False
7    False
dtype: bool

In [89]:
order[(order['amount'] >= 500) & (order['result'] == 'confirm')]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm

In [90]:
# 그러나 위의 방식은 코드가 가로로 길어지는 문제점이 있음
# 아래는 추천하는 방법

high = (order['amount'] >= 500)
confirm = (order['result'] == 'confirm')

# &(and, shift + 7)

order[high & confirm]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm

In [91]:
# or도 사용 가능
# | (or, shift + 대괄호 닫는 버튼 오른쪽)
# 둘중 하나라도 해당되는 것

order[high | confirm]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [92]:
# 색인한 다음에 column에 접근하기
# 날짜를 색인한 다음에 amount 검색
# 하지만 이는 Pandas에서 권장하지 않는 방식.
# 바깥쪽 기준으로 대괄호를 2번 열고 닫으므로. 실행이 느림

order[order['date'] == '2017-01-09']['amount']

id
5    700
6    600
Name: amount, dtype: int64

In [93]:
# 권장하는 방식
# 위의 행렬 동시 검색과 같음 order.loc[1, 'date']

order.loc[order['date'] == '2017-01-09', 'amount']

id
5    700
6    600
Name: amount, dtype: int64

In [94]:
# 하나하나를 여러개로 바꾸고 싶다 -> List 사용

order.loc[order['date'] == '2017-01-09', ['date', 'amount', 'result']]

         date  amount   result
id
5  2017-01-09     700  confirm
6  2017-01-09     600   cancel

## Column 추가하기 & 수정하기

In [95]:
order

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [96]:
# 1. Column 추가하기 첫번째 방법
# 추가하는 column 안의 값이 다 똑같은 경우

order['card-holder'] = 'KB Card'
order

    user_id  product_id       date  amount  address   result card-holder
id
1         3           9 2017-01-01     500    Seoul  confirm     KB Card
2         1           7 2017-01-03     700    Seoul  confirm     KB Card
3         3           8 2017-01-03     900  Daejeon  confirm     KB Card
4         4           2 2017-01-07     500      NaN   cancel     KB Card
5         7           3 2017-01-09     700  Incheon  confirm     KB Card
6         5           7 2017-01-09     600    Busan   cancel     KB Card
7         2           5 2017-01-10     200      NaN   cancel     KB Card

In [97]:
# 똑같은 문법인데 Column을 추가하는 데도 쓰일 수 있고 수정하는 데도 쓰일 수 있음

order['card-holder'] = 'Hyndai card'
order

    user_id  product_id       date  amount  address   result  card-holder
id
1         3           9 2017-01-01     500    Seoul  confirm  Hyndai card
2         1           7 2017-01-03     700    Seoul  confirm  Hyndai card
3         3           8 2017-01-03     900  Daejeon  confirm  Hyndai card
4         4           2 2017-01-07     500      NaN   cancel  Hyndai card
5         7           3 2017-01-09     700  Incheon  confirm  Hyndai card
6         5           7 2017-01-09     600    Busan   cancel  Hyndai card
7         2           5 2017-01-10     200      NaN   cancel  Hyndai card

In [98]:
# 2. Column 안의 값이 다를 때
# Pandas에서 Column을 추가하거나 수정할 때 절대적인 Rule: 개수만 맞추기
# 개수만 맞으면 Pandas에서 infer(추론하다)를 통해 어떻게든 넣어줌

order['order'] = [1, 2, 3, 4, 5, 6, 7]

order

,user_id,product_id,date,amount,address,result,card-holder,order
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7

In [99]:
# 위의 방식처럼 매번 List로 작성해서 넣을순 없음(데이터가 많을수도 있으므로)
# 보통 조건별로 넣음

# order['VIP'] = ?

order['VIP'] = order['amount'] >= 500

order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1,True
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2,True
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3,True
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4,True
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5,True
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6,True
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7,False

In [100]:
# 2가지 조건

(order['amount'] >= 500) & (order['result'] == 'confirm')

id
1     True
2     True
3     True
4    False
5     True
6    False
7    False
dtype: bool

In [101]:
order['VIP'] = (order['amount'] >= 500) & (order['result'] == 'confirm')

order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1,True
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2,True
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3,True
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4,False
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5,True
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6,False
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7,False

In [102]:
# True, False가 아닌 경우

order.loc[(order['amount'] >= 500) & (order['result'] == 'confirm'), 'status'] = 'VIP'
order.loc[(order['amount'] < 500) | (order['result'] == 'cancel'), 'status'] = 'None-VIP'

order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP,status
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1,True,VIP
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2,True,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3,True,VIP
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4,False,None-VIP
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5,True,VIP
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6,False,None-VIP
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7,False,None-VIP

## 삭제하기

In [103]:
# drop은 row를 삭제하는 기능도 있고 column을 삭제하는 기능도 있음
# column을 삭제하고 싶으면 axis = 'clumns' 추가

order.drop('status', axis = 'columns')

,user_id,product_id,date,amount,address,result,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1,True
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2,True
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3,True
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4,False
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5,True
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6,False
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7,False

In [104]:
# 여러 개 지우고 싶으면 List 사용

order.drop(['status', 'VIP'], axis = 'columns')

,user_id,product_id,date,amount,address,result,card-holder,order
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7

In [105]:
# 원본은 살아있음

order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP,status
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1,True,VIP
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2,True,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3,True,VIP
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4,False,None-VIP
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5,True,VIP
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6,False,None-VIP
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7,False,None-VIP

In [106]:
# 이런 식으로 넣어줘야 원본에서도 삭제가 됌

order = order.drop(['status', 'VIP'], axis = 'columns')

order

,user_id,product_id,date,amount,address,result,card-holder,order
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7

In [107]:
# row를 삭제할 때

# order.drop(3, axis = 'rows')
order.drop(3)

,user_id,product_id,date,amount,address,result,card-holder,order
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7

## apply

In [108]:
order

,user_id,product_id,date,amount,address,result,card-holder,order
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7

In [109]:
# amount에 있는 value 들이 is_vip라는 함수에 순서대로 계속 들어감
# 반복문과 비슷

def is_vip(amount):
    # ?
    # ?
    # ?
    # ?
    return amount

order['amount'].apply(is_vip)

id
1    500
2    700
3    900
4    500
5    700
6    600
7    200
Name: amount, dtype: int64

Pandas로는 구현하는 방법을 모르겠거나 구현할 수 없는 경우 apply를 사용해서 Python으로 사용할 수 있음

In [110]:
def is_vip(amount):
    if amount >= 500:
        return 'VIP'
    else:
        return 'None-VIP'

order['status'] = order['amount'].apply(is_vip)

order

,user_id,product_id,date,amount,address,result,card-holder,order,status
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1,VIP
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3,VIP
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4,VIP
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5,VIP
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6,VIP
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7,None-VIP

In [111]:
def is_vip(row):
    amount = row['amount']
    result = row['result']
    
    if amount >= 500 and result == 'confirm':
        return 'VIP'
    else:
        return 'None-VIP'
    
    return amount

order['status'] = order.apply(is_vip, axis = 'columns')

order

,user_id,product_id,date,amount,address,result,card-holder,order,status
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,Hyndai card,1,VIP
2,1,7,2017-01-03,700,Seoul,confirm,Hyndai card,2,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,Hyndai card,3,VIP
4,4,2,2017-01-07,500,NaN,cancel,Hyndai card,4,None-VIP
5,7,3,2017-01-09,700,Incheon,confirm,Hyndai card,5,VIP
6,5,7,2017-01-09,600,Busan,cancel,Hyndai card,6,None-VIP
7,2,5,2017-01-10,200,NaN,cancel,Hyndai card,7,None-VIP

## Pandas 추가공부 

## 10 minutes to pandas